snlkuharlocal/src/InformationRegisters/НомераКоробокПоЛистам/НомераКоробокПоЛистам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераКоробокПоЛистам</name>
  <comment>по ЛП и Лн</comment>
  <resources>
    <name>Лист</name>
    <type>
      <types>DocumentRef.ЛистПереукладки</types>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </resources>
  <resources>
    <name>НомерСтрокиЛН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/НомераКоробокПоЛистам/ManagerModule.bsl
Функция ЗаписатьНомерКоробки(ПараметрыЗаписи) экспорт
   
	результатЗаписи = МаркировкаКС.СтруктураРезультата(ложь);
	Если ПараметрыЗаписи.Свойство("ДокОснование")
		И ТипЗнч(ПараметрыЗаписи.ДокОснование) <> Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		результатЗаписи.Успешно = Истина;
		
		Возврат результатЗаписи; 
		
	КонецЕсли; 
	
	Если НЕ ПараметрыЗаписи.Свойство("Докоснование") Тогда
		результатЗаписи.Успешно = Истина;
		
		Возврат результатЗаписи;
	КонецЕсли;
	
   
   МенеджерЗаписи = РегистрыСведений.НомераКоробокПоЛистам.СоздатьМенеджерЗаписи(); 
   ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ПараметрыЗаписи); 
   МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
   //++Данилова Е.В. 30.04.2026 HELP-9565 
   МенеджерЗаписи.ТипЛиста = МенеджерЗаписи.Лист.Метаданные().Имя; 
   //--Данилова Е.В. 30.04.2026 
   Попытка
	   
	   МенеджерЗаписи.Записать(ЛОЖЬ); 
	   
   Исключение
	   результатЗаписи.Ошибки.Добавить(ОписаниеОшибки());
	   ЗаписатьВЛог("Номера коробок листов","Дубль при записи номера коробки листа "+ ОписаниеОшибки(),"Информация"); 
	   Возврат результатЗаписи; 
   КонецПопытки; 
   
   результатЗаписи.Успешно = Истина; 
   
   Возврат результатЗаписи;
   
КонецФункции // ЗаписатьНомерКоробки()

Процедура ОчиститьЗаписьПоЛисту(Знач Лист) Экспорт
   // Кухарь А.Ю.  08.05.2026 начало
   //HELP-9724
  ТипЛиста = ТипЗнч(Лист);
  если ТипЛиста <> Тип("ДокументСсылка.ЛистНабора") 
	 и ТипЛиста <> Тип("ДокументСсылка.ЛистПереукладки") 
	 тогда         
	ЗаписатьВЛог("Отладка",СтрШаблон("Попытка очистить запись в НомераКоробокПоЛистам неизвестно от чего. Тип - %1, Значение %2"
	,Строка(ТипЛиста),Строка(Лист)),"Информация");  
	Возврат;
	 КонецЕсли;
   // Кухарь А.Ю.  08.05.2026 конец
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераКоробокПоЛистам.ДокОснование КАК ДокОснование,
		|	НомераКоробокПоЛистам.НомерКоробки КАК НомерКоробки
		|ИЗ
		|	РегистрСведений.НомераКоробокПоЛистам КАК НомераКоробокПоЛистам
		|ГДЕ
		|	НомераКоробокПоЛистам.Лист = &Лист";
	
	Запрос.УстановитьПараметр("Лист", Лист);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.НомераКоробокПоЛистам.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.ДокОснование.Установить(ВыборкаДетальныеЗаписи.ДокОснование); 
		НаборЗаписей.Отбор.НомерКоробки.Установить(ВыборкаДетальныеЗаписи.НомерКоробки); 
		НаборЗаписей.Записать(); 
	КонецЦикла;  

КонецПроцедуры 

Функция СтруктураПараметровЗаписиВРегистр() Экспорт

	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("ДокОснование");
	ПараметрыЗаписи.Вставить("НомерКоробки");
	ПараметрыЗаписи.Вставить("Лист");
	ПараметрыЗаписи.Вставить("НомерСтрокиЛН"); 
	
	Возврат  ПараметрыЗаписи; 

КонецФункции // СтруктураПараметровЗаписиВРегистр()
